[{"title": "Your mom has as little class as Karl Marx's utopia", "selftext": "[removed]", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1451426862, "id": "3ypf31"}, {"title": "The Prom (similar to another joke on here)", "selftext": "The day of prom, a boy goes to pick his girlfriend up early, so they could spend the whole day together instead of just the evening. He asks her what she wants to do, and she tells him she wants to go get something to eat. When they try to find a place, however, they see that everywhere they try to go has an incredibly long line.\n\"That's okay,\" says the girl. \"I wasn't really that hungry anyway. Do you want to go see a movie?\" The boy says yes, and they go to the theater. Unfortunately, there was an immensely long line there as well, so they decided against it.\nThe day goes on and on like this, with every plan they try to make being blocked by a long line. Eventually, it's time to go to prom, and they make their way into the building.\nExhausted with how their day has gone so far, the girl drops into a nearby folding chair and says, \"I'm really thirsty. Can you go get me some punch?\"\nThere was no punch line.", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1439049169, "id": "3g94a4"}, {"title": "Too intense", "selftext": "A woman walks into a bar. The bartender asks \"what'll it be?\" To which she replies \"I'll have a double entendre.\" So he gave it to her.", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1431265986, "id": "35ho97"}, {"title": "The Plumber", "selftext": "A lady was expecting the plumber; he was supposed to come at ten o'clock. Ten o'clock came and went; no plumber; eleven o'clock, twelve o'clock, one o'clock; no plumber.    \n\nShe concluded he wasn't coming, and went out to do some errands. While she was out, the plumber arrived.    \n\nHe knocked on the door; the lady's parrot, who was at home in a cage by the door, said, \"Who is it?\"    \n\nHe replied, \"It's the plumber.\"    \n\nHe thought it was the lady who'd said, \"Who is it?\" and waited for her to come and let him in. When this didn't happen he knocked again, and again the parrot said, \"Who is it?\"    \n\nHe said, \"It's the plumber!\"    \n\nHe waited, and again the lady didn't come to let him in. He knocked again, and again the parrot said, \"Who is it?\"    \n\nHe said, \"It's the plumber!!!!!!!!\"    \n\nAgain he waited; again she didn't come; again he knocked; again the parrot said, \"Who is it?\"; \"Aarrrrrrgggggghhhhhhh!!!\" he said, flying into a rage; he pushed the door in and ripped it off its hinges. He suffered a heart attack and he fell dead in the doorway.    \n\nThe lady came home from her errands, only to see the door ripped off its hinges and a corpse lying in the doorway, \"A dead body!\" she exclaimed, \"Who is it?!\"    \n\nThe parrot said, \"It's the plumber.\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1428739428, "id": "327o0p"}, {"title": "Why did ye Olde chicken cross St. James street?", "selftext": "He had a luncheon appointment with the queen on the far side.", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1424480938, "id": "2wlzjc"}, {"title": "Why Was Whimsburrow Always inebriated on his transatlantic trip?", "selftext": "", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1410762524, "id": "2gfrnu"}, {"title": "A School Joke Classic (Read)", "selftext": "", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1408501336, "id": "2e1m1s"}, {"title": "A man wakes up", "selftext": "A man wakes up at home with a huge hangover. He forces himself to open his eyes, and the first thing he sees is a couple of aspirins and a glass of water on the side table.\n\nHe sits up and sees his clothing in front of him, all clean and pressed. He looks around the room and sees that it is in perfect order, spotless, clean.\n\nSo is the rest of the house. He takes the aspirins and notices a note on the table: \"Darling, breakfast is on the stove, I left early to go shopping. Love you.\" So he goes to the kitchen, and sure enough there is a hot breakfast and the morning newspaper.\n\nHis son is also at the table, eating. He asks, \"Son, what happened last night?\"\n\nHis son says, \"Well, you came home after 3 A.M., drunk and delirious, broke some furniture, puked in the hallway, and gave yourself a black eye when you stumbled into the door.\"\n\nConfused, He asks, \"So, why is everything in order and so clean, and breakfast is on the table waiting for me?\"\n\nHis son replies, \"Oh, that! Mom dragged you to the bedroom, and when she tried to take your pants off, you said, \"Lady, leave me alone, I'm married!!!\"\n", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1401661209, "id": "2728z5"}, {"title": "What is the difference between a taxidermist and a tax collector?", "selftext": "The taxidermist takes only your skin. [Mark Twain]", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1401520162, "id": "26xwpc"}, {"title": "A panda bear", "selftext": "A panda bear escapes from the zoo and is forced to live on his own. It turns out that he really enjoys eating in nice restaurant, but of course being a panda with no job and no money he is unable to pay his bill. Being, also, an exceptionally intelligent panda he devises a scheme that lets him eat in any restaurant he wishes.\n\nOne day he decides to try a particularly nice restaurant but when he asks the maitre d' for a table he's told, \"I've hear about you. Your the panda that never pays for his meal. We won't seat you here.\" So, the panda leaves the restaurant and sits on a bench across the street from the restaurant and contemplates his empty tummy.\n\nSome while later the panda sees the maitre d' leave the restaurant. The panda goes back and asks the assistant maitre d' for a table, and is seated by the assistant who has never heard about the panda's tricks. The panda has a wonderful meal. \n\nJust as he finishes desert the panda is approached by the maitre d' who has returned to discover the assistant maitre d's mistake. When the maitre d' demands payment the panda pulls a gun, shoots the maitre d' and starts to leave. The assistant maitre d' stops the panda and asks, \"Where do you think you are going?\"\n\n\"I'm leaving.\" \"You can't leave!\" \"Sure I can.\" \"No you can't!\"\nAt which point the panda produces the encyclopedia volume \"P\", opens it and tells the assistant, \"Read this.\"\n\nThe assistant maitre d' reads aloud: \"Panda, an animal indigenous to China that EATS, SHOOTS and LEAVES.\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1397902115, "id": "23fe23"}, {"title": "The Loan", "selftext": "So once upon a time there was a frog. This frog wishes to vacation to the Bahamas, so he goes to the bank to take out a loan. He walks up to the teller's desk, noticing her name was Paddy Whack. He asks her \"Um excuse me ma'am, I'd like to take out a loan\" the teller looks up from her desk and says, \"Name please.\" \"Kermit,\" the frog said. \"Kermit Jagger. My dad's Mick Jagger.\" Paddy then asks \"Do you have a collateral?\"  The frog then hands her a small porcelain platypus. Paddy goes to her manager's office and tells him about the frog and the loan, and his collateral. The manager replies, it's a knick-knack, Paddy Whack, give the frog a Loan! His old man's a rolling stone!\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1397013977, "id": "22kt4q"}, {"title": "A Scientist's Stunning Revelation", "selftext": "Cannot take credit, read it on Reddit.\n\nA scientist had been working for 30 years in utter secrecy.\n\nOne day, he announced that the project was finished and he would announce his findings at a symposium.\n\n\"Good evening, everyone.\" The scientist addressed the crowd before him. \"Today I will show that spiders can hear and understand human language and follow commands.\" The crowd sighed in doubt. \n\nThe scientist put a spider on the podium and commanded it to walk forward, backward, left and right. The spider did it all without hesitation.\n\nThe crowd erupted in applause.\n\n\"Thank you,\" the scientist said. \"Now for the next part of the experiment.\" The scientist removed each of the spider's legs one-by-one, and gave it the same commands. The spider didn't move. \n\n\"In conclusion,\" said the scientist, \"I have shown that spiders can understand human language. And when you remove their legs, they can no longer hear.\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1396382155, "id": "21y9ln"}, {"title": "A country holiday", "selftext": "A gentleman one day visited his friend's country estate so the two could catch up in leisure. Retiring to the smoking room one night, the two settled in for cognac and cigars by the fire, next to which slept the friend's old hound. After a few minutes the gentleman was surprised to hear the hound yelp \"I am the world's greatest poker player!\"\n\nConvinced the cognac was muddling his senses, the gentleman ignored the hound until startled by the dog's next proclamation.\n\n\"I am personal friends with several Hanoverian monarchs!\" he barked.\n\nQuite perturbed, the gentleman began to scrutinize the animal in earnest. The hound seemed to stir and again made an outlandish statement, bellowing \"I can outrun a volley of cannon!\"\n\nCertain this time the hound was the source of these strange pronouncements, the gentleman turned to his friend.\n\n\"Surely, you've heard your hound saying the most incredible things! I am astounded by his behavior, it's the most extraordinary thing I've ever witnessed. Yet you've never even told me of this ability. Say, what do you plan to do about the animal?\"\n\n\"Oh, nothing,\" the friend replied. \"It's been ever my policy to let sleeping dogs lie.\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1394403801, "id": "1zzy96"}, {"title": "100 Subscribers!", "selftext": "We have now passed 100 Subscribers! I can definitely say I never expected this subreddit to take off! Mainly because I slapped the whole thing together in less than 15 minutes...\n\nHowever, I feel bad that so many people are eager for more superior humor during this famine of funniness we are experiencing. I'll be working to fix this and you'll probably be able to catch me hunting down classy jokesters over at other subreddits. Hopefully I will be able to establish enough interest that you all will be able to enjoy at least a joke a day!\n\nAlso, this place is in need of desperate remodeling. I definitely need a better flair system and the CSS could definitely use a facelift.\n\nStay classy\n\n-martyrboy", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1394400004, "id": "1zzsam"}, {"title": "Courageous Firefighters", "selftext": "There was a Texas oil tycoon who was watching his largest oil well going up in flames. He called in the best fire fighting equipment money could buy but there was no way they could get close enough to the intense flames to reach them with their water hose. Finally, out of desperation, he called the local volunteer fire department. They chugged up in their red 1946 truck and passed every one of the state of the art rigs and headed toward the center of the fire. They stopped, jumped out, sprayed each other down with water, and then proceeded to put out the fire. When they were finally finished, the billionaire was so impressed with the crew's dedication and bravery, he awarded the chief with a check for $100,000. Later, a reporter asked the chief what he was going to do with the money. The chief replied, \"Well, the first thing we're going to do is fix those lousy brakes!\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1393471405, "id": "1z1yha"}, {"title": "New Taxi Driver", "selftext": "A taxi passenger tapped the driver on the shoulder to ask him a question. The driver screamed, lost control of the car, nearly hit a bus, went up on the footpath, and stopped centimeters from a shop window. For a second everything went quiet in the cab, then the driver said, \"Look mate, don't ever do that again. You scared the daylights out of me!\"\n\nThe passenger apologized and said, \"I didn't realize that a little tap would scare you so much.\"\n\nThe driver replied, \"Sorry, it's not really your fault. Today is my first day as a cab driver - I've been driving a funeral van for the last 25 years\".", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1393471250, "id": "1z1y90"}, {"title": "Ba-na-na!", "selftext": "A gentleman took a train from Cambridge to London. He took a seat and became aware that the man on the opposite seat had a banana in his ear. The gentleman hesitated over whether to point the man out that a banana was in his ear. The situation was rather awkward and he was unsure of how to tell them the man. The gentleman hesitated for about an hour, but when the guard announced that the train would arrive at London shortly, the gentleman made up his mind and talked to the man,\n\n\"Excuse me. You have a banana in your ear.\"\n\n\"What!?\" The man called him back to him, as one with poor hearing might.\n\nHe said again with louder voice, \"A ba-na-na is in your ear!\"\n\nThe man attempted to read the gentleman's lips but could not and finally replied, \"Sorry, I cannot hear you. I have a banana in my ear!\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1391536607, "id": "1x03ei"}, {"title": "The Greatest Joke Of All!", "selftext": "", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1391224139, "id": "1wp83s"}, {"title": "The Bee", "selftext": "There once a colony, and in that colony lived a bee. That bee grew tired of the bee life, and decided to leave the colony. Deciding to attend high school, the bee graduates at the top of his class. After graduation, the bee attends Harvard University, and graduates at the top of his class, yet again. The bee decides to go into politics. He first becomes mayor of his hometown, then governor of his state, and finally President of the United States of America. After his 8-year tenure as President, (since obviously he was reelected) he returns to his colony to retire. When he arrived home, he realizes he is extremely thirsty. He originally goes to the water, but there is a huge line. He then checks the apple juice line, but there is another huge line. Suddenly, the bee remembers something: there is never a line for the fruit punch. Lo and behold, when he checks, there is no punch line.", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390518997, "id": "1vzflb"}, {"title": "The Parrot and the Magician", "selftext": "A magician is hired to perform on a luxury cruise liner. One day when performing a show, he hears a voice from the crowd saying \"It's a trick! The card was up his sleeve all along!\"\n\nStartled, the magician looks around and is surprised to see the voice came from a parrot, sitting in the front row. Slightly put off, the magician tries to carry on but every time he tries to do an illusion, the parrot gives it away. \"It's a fake hand!\" \"The rabbit was in the box!\"\n\nThis goes on day after day until after a week, the magician dreads going out on stage and having to confront the parrot. However, on the eight night the ship hits an iceberg and sinks. \n\nStruggling in the icy water, the magician eventually manages to pull himself into an empty lifeboat, floating in the sea. As he lay in the boat, tired and cold, he saw the parrot fly over and sit on the bow.\n\nThe parrot stared at the magician and the magician stared back but neither spoke and together they sat in silence. After several hours, the parrot looks at the magician and says\n\n\"All right. I give up. What did you do with the ship?\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390514434, "id": "1vz7p2"}, {"title": "Motivational Seminar", "selftext": "At a motivational seminar, three men are asked to come up to the stage. They are all asked, \"When you are in your casket and friends and family are mourning upon you, what would you like to hear them say about you?\"\n\nThe first guy says, \"I would like to hear them say that I was the great doctor of my time, and a great family man.\"\n\nThe second guy says, \"I would like to hear that I was a wonderful husband and school teacher who made a huge difference in our children of tomorrow.\"\n\nThe last guy replies, \"I would like to hear them say...... LOOK!!! HE'S MOVING!!!!!\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390413782, "id": "1vv87p"}, {"title": "ANNOUNCEMENT -- Custom User Flair", "selftext": "If you want a flair, send me a 32x32 png file, either by sending a download link via pm, or by emailing me at martyrboyofmc@gmail.com. When emailing, be sure to include your username.\n\nThanks!  \n--martyrboy", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390327495, "id": "1vs0de"}, {"title": "Hearing Problems", "selftext": "There was an elderly man visiting a doctor for his check-up. As he was leaving he asked the doctor if he could recommend a specialist for his wife. \"What's wrong with her?\" asked the doctor. The old man explained that her hearing was getting so bad that it was almost embarrassing. The doctor said he knew of several specialists that could help but he wanted the old man to do a little test when he got home to help the doctor determine the severity of her hearing loss. The doctor said \"When you get home, make sure your wife's back is turned to you and ask her a question. If she doesn't respond walk closer and ask her again. Keep doing this until she answers and let me know the results\".\n\nThat night when the old man opened the door of his home he could see his wife in the kitchen preparing dinner. She was at the counter with her back to the door. \"What's for dinner?\" the old man asked. His wife did not respond so he walks to the doorway of the kitchen and asked the question again. Still, he was greeted with silence. This time he walks up just behind her and asks once again \"What's for dinner?\" His wife spins around a bit agitated and says \"For the third time, Fried Chicken!!\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390322660, "id": "1vrs6l"}, {"title": "Speeding Ticket", "selftext": "A driver was pulled over by a police officer for speeding. As the officer was writing the ticket, he noticed several machetes in the car. \n\n\"What are those for?\" he asked suspiciously. \n\n\"I'm a juggler,\" the man replied. \"I use those in my act.\"\n\n\"Well, show me,\" the officer demanded, still a little unsure. So he got out the machetes and started juggling them, first three, then more, finally seven at one time, overhand, underhand, behind the back, putting on a dazzling show and amazing the officer. Just then another car passed by.\n\nThe driver did a double take, and said, \"That's it Maude. I've got to give up the drink! Just look at the sobriety test they're giving now!!\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390280859, "id": "1vqmg0"}, {"title": "Talking Dog For Sale", "selftext": "A man sees a sign in front of a house: \"Talking Dog for Sale.\" He rings the bell and the owner tells him the dog is in the backyard. He goes into the backyard and sees a black mutt just sitting there.\n\n\"You talk?\" he asks.\n\n\"Yep,\" the mutt replies.\n\n\"So, what's your story?\"\n\nThe mutt looks up and says, \"Well, I discovered this gift pretty young and I wanted to help the government, so I told the CIA about my gift, and in no time they had me jetting from country to country, sitting in rooms with spies and world leaders, because no one figured a dog would be eavesdropping. I was one of their most valuable spies eight years running. But, the jetting around really tired me out, and I knew I wasn't getting any younger and I wanted to settle down. So, I signed up for a job at the airport to do some undercover security work, mostly wandering near suspicious characters and listening in. I uncovered some incredible dealings there and was awarded a batch of medals. Had a wife, a mess of puppies, and now I'm just retired.\"\n\nThe man is amazed. He goes back in and asks the owner what he wants for the dog.\n\nThe owner says, \"Ten dollars.\"\n\nThe guy says, \"This dog is amazing. Why on earth are you selling him so cheap?\"\n\nThe owner replies, \"He's such a liar. He didn't do any of that stuff.\"", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390264314, "id": "1vpw51"}, {"title": "Flying Blind", "selftext": "All the passengers are seated on a plane out on the tarmac and the stewardess announces “we’re just waiting for the pilots.” The passengers look out the window and see two men, dressed as pilots walking towards the plane. Both men are using guide dogs and appear to be blind. There are murmurs among the passengers, and some believe it is a joke. The men board the plane and go into the cockpit. More concerned murmurs and uneasy chuckles from the passengers. The plane taxis normally to the runway and begins it’s takeoff. As passengers look out the window they realize they are nearing the end of the runway. The entire passenger cabin begins screaming but the plane lifts off just before the end of the runway. The passengers calm down and chuckle to themselves. In the cockpit, the pilot turns to his copilot and says “you know, one day those people are gonna scream too late and we’re all gonna die!”", "domain": "self.ClassyJokes", "over_18": false, "created_utc": 1390264126, "id": "1vpvuj"}]